function Perspective = GetPerspective()
%获取投资者观点
%% 个数
Perspective = cell(9,4);

%%
%四种资产按顺序为股市、期市、国债、货币
%第一个观点为，2013年1月1日，国债比股市收益搞10%，信心水平80%。
%股市比货币收益高2%，信心水平80%；股市比期货收益高2%，信心水平50%
theday = '2013-01-01';
P = [-1, 0, 1, 0; 1, 0, 0, -1;1,-1,0,0];
v=[.10 .02 .02]';
conf = [0.8; 0.8; 0.5]; %信心指数
Perspective(1,:) = {theday,P,v,conf};

theday = '2013-06-01';
P = [-1, 0, 1, 0; 1, 0, 0, -1;1,-1,0,0];
v=[.10 .02 .02]';
conf = [0.8; 0.8; 0.5]; %信心指数
Perspective(2,:) = {theday,P,v,conf};

theday = '2014-01-01';
P = [1, 0, -1, 0; 1, -1, 0, 0;1,0,-1,0;];
v=[.10 .02 .02]';
conf = [0.8; 0.8; 0.5]; %信心指数
Perspective(3,:) = {theday,P,v,conf};

theday = '2014-06-01';
P = [1, 0, -1, 0; 1, -1, 0, 0;1,0,-1,0;];
v=[.10 .02 .02]';
conf = [0.8; 0.8; 0.5]; %信心指数
Perspective(4,:) = {theday,P,v,conf};

theday = '2015-01-01';
P = [1, 0, -1, 0; 0, 0, -1, 1; 1,-1,0,0];
v=[.10 .02 .05]';
conf = [0.9; 0.7 ; 0.5]; %信心指数
Perspective(5,:) = {theday,P,v,conf};

theday = '2015-06-01';
P = [-1, 0, 1, 0; 1, 0, 0, -1;1,-1,0,0];
v=[.10 .02 .02]';
conf = [0.8; 0.8; 0.5]; %信心指数
Perspective(6,:) = {theday,P,v,conf};

theday = '2016-01-01';
P = [0, 0, -1, 1; -1, 0, 0, 1];
v=[.01 .02 ]';
conf = [0.7; 0.7]; %信心指数
Perspective(7,:) = {theday,P,v,conf};

theday = '2016-06-01';
P = [-1,1,0,0; ...
    0,1,-1,0; ...
    0,1,0,-1;...
    -1,0,1,0;...
    -1,0,0,1];
v=[.22 .20 .17 .02 .05]';
conf = [.8; .8; 0.7; 0.8 ;0.7]; %信心指数
Perspective(8,:) = {theday,P,v,conf};

theday = '2017-01-01';
P = [-1,1,0,0; ...
    0,1,-1,0; ...
    0,1,0,-1;...
    -1,0,1,0;...
    -1,0,0,1];
v=[.22 .20 .17 .02 .05]';
conf = [.8; .8; 0.7; 0.8 ;0.7]; %信心指数
Perspective(9,:) = {theday,P,v,conf};
end